/* Main UI */
"ManualBox" = "ManualBox";
"Settings" = "Settings";
"Notification & Reminders" = "Notification & Reminders";
"Appearance & Theme" = "Appearance & Theme";
"Data & Defaults" = "Data & Defaults";
"About & Support" = "About & Support";
"Follow System" = "Follow System";
"Chinese" = "Chinese";
"English" = "English";
"Language" = "Language";
"Export Data" = "Export Data";
"Import Data" = "Import Data";
"Data Backup & Restore" = "Data Backup & Restore";
"Reset App Data" = "Reset App Data";
"Privacy Policy" = "Privacy Policy";
"User Agreement" = "User Agreement";
"Check for Updates" = "Check for Updates";
"System Notification" = "System Notification";
"Email" = "Email";
"Calendar Event" = "Calendar Event";
"Start" = "Start";
"End" = "End";
"Silent Period" = "Silent Period";
"Warranty Advance Reminder" = "Warranty Advance Reminder";
"Maintenance Progress Push" = "Maintenance Progress Push";
"Asset Inspection/Maintenance" = "Asset Inspection/Maintenance";
"Notification Channel" = "Notification Channel";

/* Repair Records */
"Repair Records" = "Repair Records";
"Add Repair Record" = "Add Repair Record";
"Edit Repair Record" = "Edit Repair Record";
"Repair Details" = "Repair Details";
"Repair Date" = "Repair Date";
"Repair Cost" = "Repair Cost";
"Delete Repair Record" = "Delete Repair Record";
"Confirm Delete" = "Confirm Delete";
"This action cannot be undone" = "This action cannot be undone";
"Save Changes" = "Save Changes";
"Cancel" = "Cancel";
"Related Product" = "Related Product";
"No Repair Records" = "No Repair Records";
"Search Repair Records" = "Search Repair Records";
"Enter repair details..." = "Enter repair details...";

/* Theme Settings */
"Theme Mode" = "Theme Mode";
"Theme Color" = "Theme Color";
"System" = "System";
"Light" = "Light";
"Dark" = "Dark";
"系统" = "System";
"蓝色" = "Blue";
"绿色" = "Green";
"橙色" = "Orange";
"粉色" = "Pink";
"紫色" = "Purple";
"红色" = "Red";

/* Data & Default Settings */
"Default Settings" = "Default Settings";
"Data Management" = "Data Management";
"Export products, categories, and tags" = "Export products, categories, and tags";
"Import products, categories, and tags" = "Import products, categories, and tags";
"Local or iCloud backup/restore" = "Local or iCloud backup/restore";
"Clear all local data, cannot be recovered" = "Clear all local data, cannot be recovered";

/* About & Support */
"Legal & Policies" = "Legal & Policies";
"Updates & Support" = "Updates & Support";
"View app privacy policy" = "View app privacy policy";
"View app user agreement" = "View app user agreement";
"Go to the latest version download page" = "Go to the latest version download page";
"Warranty Information Assistant" = "Warranty Information Assistant";

/* Search Filters */
"Advanced Search" = "Advanced Search";
"Search Scope" = "Search Scope";
"Category Filter" = "Category Filter";
"Tag Filter" = "Tag Filter";
"Warranty Status" = "Warranty Status";
"Purchase Date" = "Purchase Date";
"Enable Category Filter" = "Enable Category Filter";
"Enable Tag Filter" = "Enable Tag Filter";
"Enable Warranty Status Filter" = "Enable Warranty Status Filter";
"Enable Date Filter" = "Enable Date Filter";
"Select Category" = "Select Category";
"All Categories" = "All Categories";
"All Statuses" = "All Statuses";
"In Warranty" = "In Warranty";
"Expiring Soon" = "Expiring Soon";
"Expired" = "Expired";
"Start Date" = "Start Date";
"End Date" = "End Date";
"Apply Filters" = "Apply Filters";
"Reset All Filters" = "Reset All Filters";
"Filter Conditions:" = "Filter Conditions:";
"Clear" = "Clear";
